app/views/homepage/_recent_listing.haml

  .listing_image
    - unless listing.listing_images.empty?
---
SELECT "listing_images".* FROM "listing_images" WHERE ("listing_images".listing_id IN (5,4,3))
SELECT COUNT(*) FROM "diet_listings" WHERE ("diet_listings".listing_id = 5)

      - if @current_user
        - if listing.comments.size > 0
          .float_right
---
SELECT COUNT(*) FROM "comments" WHERE ("comments".listing_id = 5)