app/views/listings/_listed_listing.haml

SELECT COUNT(*) FROM "comments" WHERE ("comments".listing_id = 5)
---
        = render :partial => "listings/listed_listing_edit_links", :locals => { :listing => listing }
        - if listing.comments.size > 0