app/controllers/admin/communities_controller.rb

SELECT "communities".* FROM "communities"
---
  def index
    if params[:search].nil?
      @communities = Community.all.paginate(:per_page => 15, :page => params[:page])