app/controllers/admin/profiles_controller.rb

SELECT "communities".* FROM "communities"
---
  def new
    @communities = Community.all

SELECT "communities".* FROM "communities"
SELECT "communities".* FROM "communities" WHERE "communities"."id" = 1 LIMIT 1
INSERT INTO "community_memberships" ("person_id", "community_id", "admin", "created_at", "updated_at", "consent", "invitation_id", "last_page_load_date") VALUES ('bCQWZCKwWr4Oaf3a6HdQnY', 1, 'f', '2013-03-20 14:42:24.722002', '2013-03-20 14:42:24.722002', 'RGF1.0', NULL, '2013-03-20 14:42:24.000000') RETURNING "id"
---
  def create
    @communities = Community.all
    @person = Person.new(params[:person])
    @community = Community.where(:id => params[:community]).first
    @person.set_default_preferences
     respond_to do |format|
      if @person.save
        unless @community.nil?
          @community_membership = CommunityMembership.create!(:person_id => @person.id, :community_id => @community.id, :admin => false, :consent => @community.consent )