app/views/admin/communities/_communities.html.haml

SELECT COUNT(*) FROM "community_memberships" WHERE ("community_memberships".community_id = 1)
---
          %td{ :align => "center" }
            = community.community_memberships.count