app/views/listings/form/_images.haml

    - else
      %div{:id => "listing_image_#{@listing.listing_images.first.id.to_s}"}
---
SELECT "listing_images".* FROM "listing_images" WHERE ("listing_images".listing_id = 5)