app/controllers/communities_controller.rb

SELECT "form_details".* FROM "form_details" LIMIT 1
---
  def new
    @community = Community.new
    @community.community_memberships.build
    unless @community.location
      @community.build_location(:address => @community.address, :location_type => 'community')
      @community.location.search_and_fill_latlng
    end
    @person = Person.new
    @text_info = FormDetail.first

INSERT INTO "communities" ("name", "domain", "created_at", "updated_at", "settings", "consent", "email_admins_about_new_members", "use_fb_like", "real_name_required", "feedback_to_admin", "automatic_newsletters", "join_with_invite_only", "use_captcha", "email_confirmation", "allowed_emails", "users_can_invite_new_users", "select_whether_name_is_shown_to_everybody", "private", "label", "show_date_in_listings_list", "news_enabled", "all_users_can_add_news", "custom_frontpage_sidebar", "event_feed_enabled", "members_count", "slogan", "description", "category", "polls_enabled", "plan", "user_limit", "monthly_price_in_euros") VALUES ('pune', 'pune', '2013-03-04 12:30:46.013659', '2013-03-04 12:30:46.013659', '---
INSERT INTO "locations" ("latitude", "longitude", "address", "google_address", "city", "created_at", "updated_at", "listing_id", "person_id", "location_type", "community_id") VALUES (18.5204303, 73.85674369999992, 'pune', 'Pune, Maharashtra, India', NULL, '2013-03-04 12:30:46.181842', '2013-03-04 12:30:46.181842', NULL, NULL, 'community', 1) RETURNING "id"
---
  def create
    params[:community][:location][:address] = params[:community][:address] if params[:community][:address]
    location = Location.new(params[:community][:location])
    params[:community].delete(:location)
    params[:community].delete(:address)
    @community = Community.new(params[:community])
    en = "en"
    ary = Array(en);
    @community.settings = {"locales"=> ary } #["#{params[:community_locale]}"]
    @community.email_confirmation = true
    @community.plan = "free"#session[:pricing_plan]
    @community.users_can_invite_new_users = true
    @community.use_captcha = false
    @community.save
    @community.community_memberships.first.update_attribute(:admin, true) #make creator an admin
    location.community = @community
    location.save

SELECT "emails".* FROM "emails" WHERE "emails"."address" = 'saraf.chaitanya@gmail.com' LIMIT 1
---
  def set_organization_email
    session[:allowed_email] = "@#{params[:email].split('@')[1]}"
    if @current_user.has_confirmed_email?(params[:email])
      session[:confirmed_email] = params[:email]
    else
      # no confirmed allowed email found.
      # Check if there is unconfirmed or should we add one.

      if @current_user.email == params[:email] # check primary email
        @current_user.send_confirmation_instructions
      else
        if @current_user.has_email?(params[:email]) #unconfirmed additional email
          e = Email.find_by_address(params[:email])