app/controllers/confirmations_controller.rb

SELECT 1 FROM "communities" INNER JOIN "community_memberships" ON "communities".id = "community_memberships".community_id WHERE "communities"."id" = 1 AND (("community_memberships".person_id = 'cKT52MHzSr4Oaj3a6HdQnY')) LIMIT 1
SELECT COUNT(*) FROM "communities" INNER JOIN "community_memberships" ON "communities".id = "community_memberships".community_id WHERE (("community_memberships".person_id = 'dIghaMHc4r4Oaa3a6HdQnY'))
---
  def show
    self.resource = resource_class.confirm_by_token(params[:confirmation_token])

    if resource.errors.empty?
      set_flash_message(:notice, :confirmed) if is_navigational_format?
      sign_in(resource_name, resource)
      @person = Person.find_by_id(resource.id)
       if @current_user and @current_community
        redirect_to root_path(:cid => "#{@current_community.id}")
       elsif @person and !@person.communities.empty?