app/controllers/homepage_controller.rb

SELECT "event_feed_events".* FROM "event_feed_events" WHERE ("event_feed_events".community_id = 1) ORDER BY id DESC LIMIT 5
SELECT "event_feed_events".* FROM "event_feed_events" WHERE "event_feed_events"."members_only" = 'f' AND ("event_feed_events".community_id = 1) ORDER BY id DESC LIMIT 5
SELECT COUNT(*) FROM "diet_listings" WHERE ("diet_listings".listing_id = 5)
SELECT COUNT(*) FROM "event_feed_events" WHERE ("event_feed_events".community_id = 1)
SELECT "news_items".* FROM "news_items" WHERE ("news_items".community_id = 1) ORDER BY created_at DESC LIMIT 2
SELECT COUNT(*) FROM "swap_items" WHERE ("swap_items".receiver_id = 'dPgoR6J6qr4Oaj3a6HdQnY') AND (acceptance is null)
SELECT "communities".* FROM "communities"
---
  def index
    if @current_user && @current_community && @current_user.member_of?(@current_community)
      @event_feed_events = @current_community.event_feed_events.limit(5).order("id DESC")
    elsif @current_community
      @event_feed_events = @current_community.event_feed_events.non_members_only.limit(5).order("id DESC")
    else
      redirect_to root_path
    end
    listings_per_page = 15

    # If requesting a specific page on non-ajax request, we'll ignore that
    # and show the normal front page starting from newest listing
    params[:page] = 1 unless request.xhr?

    if @current_community
      @requests = Listing.requests.visible_to(@current_user, @current_community).open.paginate(:per_page => listings_per_page, :page => params[:page])
      @offers = Listing.offers.visible_to(@current_user, @current_community).open.paginate(:per_page => listings_per_page, :page => params[:page])
    end
    # TODO This below should only be done if the count is actually shown, otherwise unnecessary.
    #If browsing Sharetribe unlogged, count also the number of private listings available
    unless @current_user
      @private_listings = {}
      @private_listings["request"] = Listing.requests.open.private_to_community(@current_community).count
      @private_listings["offer"] = Listing.offers.open.private_to_community(@current_community).count
    end

    if request.xhr? # checks if AJAX request
      render :partial => "additional_listings", :locals => {:type => :request, :requests => @requests, :offers => @offers}
    else
      if @current_community && @current_community.news_enabled?
        @news_items = @current_community.news_items.order("created_at DESC").limit(2)
        @news_item_count = @current_community.news_items.count
      end
    end
      @all_communities = Community.all