app/controllers/listings_controller.rb

SELECT COUNT(*) FROM "diet_listings" WHERE ("diet_listings".listing_id = 5)
SELECT COUNT(*) FROM "listings" INNER JOIN "locations" ON "locations"."listing_id" = "listings"."id" WHERE (open = '1' AND (valid_until IS NULL OR valid_until > '2013-03-20 15:37:03')) AND ((valid_from IS NOT NULL and valid_until IS NOT NULL) and (valid_from <= '2013-03-20 15:37:04' and valid_until >= '2013-03-20 15:37:04')) AND (google_address LIKE '% Pune%') AND (
---
  def load
    @title = params[:listing_type]
    @tag = params[:tag]
    @to_render ||= {:partial => "listings/listed_listings"}
    @listings = Listing.open.order("created_at DESC").find_with(params, @current_user, @current_community).paginate(:per_page => 15, :page => params[:page])

SELECT listings.id, listing_type, category, latitude, longitude FROM "listings" INNER JOIN "locations" ON "locations"."listing_id" = "listings"."id" AND location_type = 'origin_loc' INNER JOIN "locations" "locations_listings" ON "locations_listings"."listing_id" = "listings"."id" WHERE (open = '1' AND (valid_until IS NULL OR valid_until > '2013-03-20 15:36:49')) AND ((valid_from IS NOT NULL and valid_until IS NOT NULL) and (valid_from <= '2013-03-20 15:36:50' and valid_until >= '2013-03-20 15:36:50')) AND (google_address LIKE '% Pune%') AND (
---
  def serve_listing_data
    @listings = Listing.open.joins(:origin_loc).group("listings.id").
                order("listings.created_at DESC").find_with(params, @current_user, @current_community).select("listings.id, listing_type, category, latitude, longitude")

UPDATE "listings" SET "times_viewed" = 2, "updated_at" = '2013-03-20 15:26:42.457865' WHERE "listings"."id" = 5
---
  def show
    @listing.increment!(:times_viewed)

SELECT "form_details".* FROM "form_details" LIMIT 1
---
  def new
     logger.info ">>>>>>>>>>>>>>>>>>>>>>>>>>>>>NEW >>>>>>>>>>>>>>>>>>>>>>>#{params}>>>>>>>>>>>>>>>"
    @text_info = FormDetail.first

SELECT "listing_images".* FROM "listing_images" WHERE ("listing_images".listing_id = 5)
SELECT COUNT(*) FROM "listing_images" WHERE ("listing_images".listing_id = 5)
---
  def edit
	  if !@listing.origin_loc
	      @listing.build_origin_loc(:location_type => "origin_loc")
	  end
    1.times { @listing.listing_images.build } if @listing.listing_images.empty?

UPDATE "listings" SET "origin" = '', "delta" = 't', "updated_at" = '2013-03-20 15:27:26.259533' WHERE "listings"."id" = 5
---
  def update
    if (params[:listing][:origin] && (params[:listing][:origin_loc_attributes][:address].empty? || params[:listing][:origin].blank?))
      params[:listing].delete("origin_loc_attributes")
      if @listing.origin_loc
        @listing.origin_loc.delete
      end
    end
    if @listing.update_fields(params[:listing])