app/controllers/people_controller.rb

SELECT "community_memberships".* FROM "community_memberships" WHERE "community_memberships"."person_id" = 'dPgoR6J6qr4Oaj3a6HdQnY' AND "community_memberships"."community_id" = 1 LIMIT 1
---
  def show
    @community_membership = CommunityMembership.find_by_person_id_and_community_id(@person.id, @current_community.id)

SELECT "form_details".* FROM "form_details" LIMIT 1
---
  def new
    redirect_to root if logged_in?
    @person = Person.new
    @text_info = FormDetail.first

SELECT "community_memberships".* FROM "community_memberships" WHERE "community_memberships"."person_id" = 'cKT52MHzSr4Oaj3a6HdQnY' AND "community_memberships"."community_id" = 1 LIMIT 1
INSERT INTO "community_memberships" ("person_id", "community_id", "admin", "created_at", "updated_at", "consent", "invitation_id", "last_page_load_date") VALUES ('cKT52MHzSr4Oaj3a6HdQnY', 1, 'f', '2013-03-05 13:50:55.029188', '2013-03-05 13:50:55.029188', 'RGF1.0', NULL, '2013-03-05 13:50:55.000000') RETURNING "id"
---
      # Make person a member of the current community
      if @current_community
        membership = CommunityMembership.new(:person => @person, :community => @current_community, :consent => @current_community.consent)
        membership.invitation = invitation if invitation.present?
        membership.save!

SELECT "locations".* FROM "locations" WHERE ("locations".person_id = 'dIghaMHc4r4Oaa3a6HdQnY' AND (location_type = 'person')) LIMIT 1
---
  def update

	  if params[:person] && params[:person][:location] && (params[:person][:location][:address].empty?) || (params[:person][:street_address].blank? || params[:person][:street_address].empty?)

SELECT COUNT(*) FROM "communities" WHERE (allowed_emails LIKE '%@gmail.com%')
---
  def check_email_availability_for_new_tribe
    email = params[:person] ? params[:person][:email] : params[:email]
    if email_available_for_user?(@current_user, email)
      existing_communities = Community.find_by_allowed_email(email)
      if existing_communities.size > 0 && Community.email_restricted?(params[:community_category])