app/controllers/sessions_controller.rb

  def create
    if current_community = Community.find_by_domain(params[:community])
---
SELECT "communities".* FROM "communities" WHERE "communities"."domain" = 'pune' LIMIT 1

      redirect_to new_tribe_path
    elsif @current_user.communities.include?(@current_community) || @current_user.is_admin?
      flash[:notice] = [:login_successful, (@current_user.given_name_or_username + "!").to_s, person_path(@current_user)]
      EventFeedEvent.create(:person1_id => @current_user.id, :community_id => current_community.id, :category => "login") unless (@current_user.is_admin? && !@current_user.communities.include?(@current_community))
---
INSERT INTO "event_feed_events" ("person1_id", "person2_id", "community_id", "eventable_id", "eventable_type", "category", "members_only", "created_at", "updated_at") VALUES ('dIghaMHc4r4Oaa3a6HdQnY', NULL, 1, NULL, NULL, 'login', 'f', '2013-03-04 13:50:16.247121', '2013-03-04 13:50:16.247121') RETURNING "id"

  def destroy
    @authentications = Authentication.where(:user_id => @current_user.id )
    unless @authentications.nil?
      @authentications.each do |authentication|
        authentication.destroy
---
SELECT "authentications".* FROM "authentications" WHERE "authentications"."user_id" = 'dIghaMHc4r4Oaa3a6HdQnY'
DELETE FROM "authentications" WHERE "authentications"."id" = 2