app/views/layouts/_logged_in_swap_offers_icon.haml

SELECT COUNT(*) FROM "swap_items" WHERE ("swap_items".receiver_id = 'dPgoR6J6qr4Oaj3a6HdQnY') AND (acceptance is null)
---

- if @current_user.swap_items.not_replied.count > 0
  .logged_in_icon_notifications_notifications{:onclick => "location.href='/people/#{@current_user.id}/swap_items';"}
    .logged_in_icon_notification_text